	<b><size=50>Aрифметические выражения</size></b>

    <size=45>Mы уже знаем, что выводить строки можно с помощью команды <b>cout</b>. Tочно так же можно выводить числа и результат вычисления выражений. Например, вот так выглядит программа, которая считает, чему равно <b>(2 + 3) * 5</b>:</size>

    	<i><size=45><color=#191970>#include <iostream></color></size></i>

    	<i><size=45><color=#191970>using namespace std;</color></size></i>

	<i><size=45><color=#191970>int main()</color></size></i>
	<i><size=45><color=#191970>{</color></size></i>
	    <i><size=45><color=#191970>cout << (2 + 3) * 5;</color></size></i>
	    <i><size=45><color=#191970>return 0;</color></size></i>
	<i><size=45><color=#191970>}</color></size></i>

    <size=45>Если запустить эту программу, то она выведет <b>25</b>. Сначала посчитается результат вычисления арифметического выражения, а затем он будет выведен. Посмотрим, какие арифметические операции умеет выполнять C++:</size>

    	<size=45>Обозначение операции</size>		<size=45><size=60>ч</size>то она выполняет</size>
			<size=45>+</size>						<size=45>Сложение</size>
			<size=45>-</size>						<size=45>Вычитание</size>
			<size=45>*</size>						<size=45><size=60>у</size>множение</size>
			<size=45>/</size>					    <size=45>Деление нацело</size>
			<size=45>%</size>			   <size=45>Вычисление остатка от деления</size>














